There is no such VM id 1110 on the my server.

Maybe you can see any issues in the my terraform plan.

I tried the native zfs storage type (which was good for template creating)

zfast/base-9000-disk-0   2.36G   326G  2.36G  -
zfast/vm-9000-cloudinit    68K   326G    68K  -

 and zfs dataset's mount dir (zfast_dir)

`
ccr tofu apply

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # local_file.cluster_config_json will be created
  + resource "local_file" "cluster_config_json" {
      + content              = jsonencode(
            {
              + cluster_id            = 1
              + cluster_name          = "alpha"
              + kubeconfig_file_name  = "alpha.yml"
              + max_pods_per_node     = 512
              + networking            = {
                  + assign_vlan       = false
                  + bridge            = "vmbr1"
                  + dns_search_domain = "lan"
                  + ipv4              = {
                      + dns1             = "1.1.1.1"
                      + dns2             = "1.0.0.1"
                      + gateway          = "192.168.102.1"
                      + lb_cidrs         = "192.168.102.200/29,192.168.102.208/28,192.168.102.224/28,192.168.102.240/29,192.168.102.248/30,192.168.102.252/31"
                      + management_cidrs = "192.168.102.0/30,10.0.60.2,10.0.50.5,10.0.50.6"
                      + pod_cidr         = "10.42.0.0/16"
                      + subnet_prefix    = "192.168.102"
                      + svc_cidr         = "10.43.0.0/16"
                    }
                  + ipv6              = {
                      + dns1             = "2607:fa18::1"
                      + dns2             = "2607:fa18::2"
                      + dual_stack       = false
                      + enabled          = false
                      + gateway          = "2001:db8:cafe:0000::1"
                      + lb_cidrs         = ""
                      + management_cidrs = ""
                      + pod_cidr         = "2001:db8:cafe:0000:244::/80"
                      + subnet_prefix    = "2001:db8:cafe:0000"
                      + svc_cidr         = "2001:db8:cafe:0000:96::/112"
                    }
                  + kube_vip          = {
                      + kube_vip_version = "0.8.4"
                      + use_ipv6         = false
                      + vip              = "192.168.102.110"
                      + vip_hostname     = "alpha-api-server"
                      + vip_interface    = "eth0"
                    }
                  + use_pve_firewall  = false
                  + use_unifi         = false
                  + vlan_id           = null
                  + vlan_name         = null
                }
              + node_classes          = {
                  + controlplane = {
                      + cores     = 16
                      + count     = 1
                      + cpu_type  = "x86-64-v3"
                      + devices   = []
                      + disks     = [
                          + {
                              + aio_mode   = "io_uring"
                              + backup     = true
                              + cache_mode = "none"
                              + datastore  = "zfast_dir"
                              + size       = 100
                            },
                        ]
                      + labels    = [
                          + "nodeclass=controlplane",
                        ]
                      + machine   = "q35"
                      + memory    = 16384
                      + pve_nodes = [
                          + "Citadel",
                          + "Acropolis",
                          + "Parthenon",
                        ]
                      + sockets   = 1
                      + start_ip  = 110
                      + taints    = []
                    }
                }
              + ssh                   = {
                  + ssh_key_type = "ssh-ed25519"
                  + ssh_user     = "line6"
                }
              + start_on_proxmox_boot = false
              + use_pve_ha            = false
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../ansible/tmp/alpha/cluster_config.json"
      + id                   = (known after apply)
    }

  # proxmox_virtual_environment_firewall_alias.kube_vip will be created
  + resource "proxmox_virtual_environment_firewall_alias" "kube_vip" {
      + cidr    = "192.168.102.110"
      + comment = "Managed by Terraform"
      + id      = (known after apply)
      + name    = "alpha-kube-vip"
    }

  # proxmox_virtual_environment_firewall_options.node["alpha-controlplane-0"] will be created
  + resource "proxmox_virtual_environment_firewall_options" "node" {
      + dhcp          = false
      + enabled       = false
      + id            = (known after apply)
      + input_policy  = "DROP"
      + ipfilter      = false
      + log_level_in  = "nolog"
      + log_level_out = "nolog"
      + macfilter     = false
      + ndp           = true
      + node_name     = "Citadel"
      + output_policy = "ACCEPT"
      + radv          = false
      + vm_id         = 1110
    }

  # proxmox_virtual_environment_pool.operations_pool["alpha"] will be created
  + resource "proxmox_virtual_environment_pool" "operations_pool" {
      + comment = "Managed by Terraform"
      + id      = (known after apply)
      + members = (known after apply)
      + pool_id = "ALPHA"
    }

  # proxmox_virtual_environment_vm.node["alpha-controlplane-0"] will be created
  + resource "proxmox_virtual_environment_vm" "node" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = true
      + name                    = "alpha-controlplane-0"
      + network_interface_names = (known after apply)
      + node_name               = "Citadel"
      + on_boot                 = false
      + pool_id                 = "ALPHA"
      + protection              = false
      + reboot                  = false
      + scsi_hardware           = "virtio-scsi-pci"
      + started                 = true
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "k8s",
          + "alpha",
          + "controlplane",
        ]
      + template                = false
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 1110

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = true
          + type    = "virtio"
        }

      + clone {
          + full      = true
          + node_name = "Citadel"
          + retries   = 25
          + vm_id     = 9000
        }

      + cpu {
          + cores      = 16
          + flags      = []
          + hotplugged = 0
          + limit      = 0
          + numa       = true
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "zfast_dir"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "virtio0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 100
          + ssd               = false
        }

      + initialization {
          + datastore_id = "zfast_dir"
          + interface    = "ide2"
          + upgrade      = (known after apply)

          + dns {
              + domain  = "lan"
              + servers = [
                  + "1.1.1.1",
                  + "1.0.0.1",
                ]
            }

          + ip_config {
              + ipv4 {
                  + address = "192.168.102.110/24"
                  + gateway = "192.168.102.1"
                }
            }

          + user_account {
              + keys     = [
                  + "ssh-ed25519 k-e-y",
                ]
              + password = (sensitive value)
              + username = "user"
            }
        }

      + memory {
          + dedicated      = 16384
          + floating       = 0
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr1"
          + enabled     = true
          + firewall    = true
          + mac_address = (known after apply)
          + model       = "virtio"
          + mtu         = 0
          + queues      = 0
          + rate_limit  = 0
          + vlan_id     = 100
        }

      + vga {
          + memory = 16
          + type   = "serial0"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions in workspace "alpha"?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

local_file.cluster_config_json: Creating...
proxmox_virtual_environment_firewall_alias.kube_vip: Creating...
proxmox_virtual_environment_pool.operations_pool["alpha"]: Creating...
local_file.cluster_config_json: Creation complete after 0s [id=a3ea84881f47a61159897ac85ac561ace57184d8]
proxmox_virtual_environment_pool.operations_pool["alpha"]: Creation complete after 0s [id=ALPHA]
proxmox_virtual_environment_vm.node["alpha-controlplane-0"]: Creating...
proxmox_virtual_environment_vm.node["alpha-controlplane-0"]: Still creating... [10s elapsed]
...
`
